Revit 2024 API
ClosestPointsPairBetweenTwoCurves Constructor
 Obtain a new instance of ClosestPointsPairBetweenTwoCurves class.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public ClosestPointsPairBetweenTwoCurves()
Visual Basic
Public Sub New
Visual C++
public:
ClosestPointsPairBetweenTwoCurves()
See Also
ClosestPointsPairBetweenTwoCurves Class
ClosestPointsPairBetweenTwoCurves Overload
Autodesk.Revit.DB Namespace